var province = new Array('北京', '天津', '河北', '山西', '内蒙古', '辽宁', '吉林', '黑龙江', '上海', '江苏', '浙江', '安徽', '福建', '江西', '山东', '河南', '湖北', '湖南', '广东', '广西', '海南', '重庆', '四川', '贵州', '云南', '西藏', '陕西', '甘肃', '青海', '宁夏', '新疆', '香港', '澳门', '台湾');
var city = new Array();
city[0] = '北京';
city[1] = '天津';
city[2] = '石家庄,唐山,秦皇岛,邯郸,邢台,保定,张家口,承德,沧州,廊坊,衡水';
city[3] = '太原,大同,阳泉,长治,晋城,朔州,晋中,运城,忻州,临汾,吕梁';
city[4] = '呼和浩特,包头,乌海,赤峰,通辽,鄂尔多斯,呼伦贝尔,巴彦淖尔,乌兰察布,锡林浩特,乌兰浩特';
city[5] = '沈阳,大连,鞍山,抚顺,本溪,丹东,锦州,葫芦岛,营口,盘锦,阜新,辽阳,铁岭,朝阳';
city[6] = '长春,吉林,四平,辽源,通化,白山,松原,白城,延吉';
city[7] = '哈尔滨,齐齐哈尔,鹤岗,双鸭山,鸡西,大庆,伊春,牡丹江,佳木斯,七台河,黑河,绥化';
city[8] = '上海';
city[9] = '南京,无锡,徐州,常州,苏州,南通,连云港,淮安,盐城,扬州,镇江,泰州,宿迁';
city[10] = '杭州,宁波,温州,嘉兴,湖州,绍兴,金华,衢州,舟山,台州,丽水';
city[11] = '合肥,芜湖,蚌埠,淮南,马鞍山,淮北,铜陵,安庆,黄山,滁州,阜阳,宿州,巢湖,六安,亳州,池州,宣城';
city[12] = '福州,厦门,莆田,三明,泉州,漳州,南平,龙岩,宁德';
city[13] = '南昌,景德镇,萍乡,新余,九江,鹰潭,赣州,吉安,宜春,抚州,上饶';
city[14] = '济南,青岛,淄博,枣庄,东营,潍坊,烟台,威海,济宁,泰安,日照,莱芜,德州,临沂,聊城,滨州,菏泽';
city[15] = '郑州,开封,洛阳,平顶山,焦作,鹤壁,新乡,安阳,濮阳,许昌,漯河,三门峡,南阳,商丘,信阳,周口,驻马店,济源';
city[16] = '武汉,黄石,襄樊,十堰,荆州,宜昌,荆门,鄂州,孝感,黄冈,咸宁,随州,恩施,仙桃,天门,潜江';
city[17] = '长沙,株洲,湘潭,衡阳,邵阳,岳阳,常德,张家界,益阳,郴州,永州,怀化,娄底,吉首';
city[18] = '广州,深圳,珠海,汕头,韶关,佛山,江门,湛江,茂名,肇庆,惠州,梅州,汕尾,河源,阳江,清远,东莞,中山,潮州,揭阳,云浮';
city[19] = '南宁,柳州,桂林,梧州,北海,防城港,钦州,贵港,玉林,百色,贺州,河池,来宾,崇左';
city[20] = '海口,三亚';
city[21] = '重庆';
city[22] = '成都,自贡,攀枝花,泸州,德阳,绵阳,广元,遂宁,内江,乐山,南充,宜宾,广安,达州,眉山,雅安,巴中,资阳,西昌';
city[23] = '贵阳,六盘水,遵义,安顺,铜仁,毕节,兴义,凯里,都匀';
city[24] = '昆明,曲靖,玉溪,保山,昭通,丽江,思茅,临沧,景洪,楚雄,大理,潞西';
city[25] = '拉萨,日喀则';
city[26] = '西安,铜川,宝鸡,咸阳,渭南,延安,汉中,榆林,安康,商洛';
city[27] = '兰州,金昌,白银,天水,嘉峪关,武威,张掖,平凉,酒泉,庆阳,定西,陇南,临夏,合作';
city[28] = '西宁,德令哈,格尔木';
city[29] = '银川,石嘴山,吴忠,固原,中卫';
city[30] = '乌鲁木齐,克拉玛依,吐鲁番,哈密,和田,阿克苏,喀什,阿图什,库尔勒,昌吉,博乐,伊宁,塔城,阿勒泰,石河子,阿拉尔,图木舒克,五家渠';
city[31] = '香港';
city[32] = '澳门';
city[33] = '台北,高雄,基隆,台中,台南,新竹市,嘉义';


var city_arr=[];
for(var i in province){
   var child=[];
   var citys=city[i].split(',');
   for(var a in citys){
       child.push({'name':citys[a]});
   }
   city_arr.push({'name':province[i],'child':child});
}
